#+title: Integrating Scientific GUI Applications into Autoscaled Science Gateway Environments

#+bibliography: gateways2025.bib

#+author: Julien Chastang

#+options: toc:nil num:t date:nil author:nil auto-id:t

#+latex_class: IEEEtran
#+latex_class_options: [conference]
#+latex_header: \IEEEoverridecommandlockouts
#+latex_header: \hypersetup{hidelinks}
#+latex_header: \usepackage{cite}
#+latex_header: \usepackage{amsmath,amssymb,amsfonts}
#+latex_header: \usepackage{algorithmic}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{xcolor}

#+cite_export: csl ieee.csl

* 
:PROPERTIES:
:CUSTOM_ID: h-E655108A
:END:

#+begin_export latex
\title{Integrating Scientific GUI Applications into Autoscaled Science Gateway Environments}
#+end_export

#+BEGIN_SRC emacs-lisp :var data=authors-table :exports results :results replace latex :eval no
  (setq result-string "\\author{")

  (mapc
   (lambda (row)
     (setq result-string
           (concat result-string
                   (format "\\IEEEauthorblockN{%s\\textsuperscript{%s} %s %s}\n\\IEEEauthorblockA{\\textit{%s} \\\\\n%s, %s \\\\\n%s}\n\\and\n"
                           (nth 0 row) (nth 1 row) (nth 2 row) (nth 3 row)
                           (nth 4 row) (nth 5 row) (nth 6 row) (nth 7 row)))))
   data)

  ;; Remove the last "\and" from the string
  (setq result-string (substring result-string 0 (- (length result-string) 6)))

  (concat result-string "\n}")
#+END_SRC

#+RESULTS:
#+begin_export latex
\author{\IEEEauthorblockN{1\textsuperscript{st} Julien Chastang}
\IEEEauthorblockA{\textit{NSF Unidata Program Center, UCP, UCAR} \\
Boulder, CO USA \\
https://orcid.org/0000-0003-2482-3565}
\and
\IEEEauthorblockN{2\textsuperscript{nd} Ana Espinoza}
\IEEEauthorblockA{\textit{NSF Unidata Program Center, UCP, UCAR} \\
Boulder, CO USA \\
https://orcid.org/0000-0002-6292-073X}
}
#+end_export

#+begin_export latex
\maketitle
#+end_export

#+name: abstract
#+BEGIN_SRC org :exports none
We present an application of a new capability on the NSF Jetstream2 cloud that enables scalable access to established scientific desktop applications in the atmospheric sciences, including the Unidata Integrated Data Viewer (IDV), the AWIPS CAVE client, and the LROSE Hawkeye tool. By leveraging OpenStack Magnum's Kubernetes autoscaling clusters-as-a-service, in combination with JupyterHub and VNC technology, the NSF Unidata Science Gateway dynamically provisions server resources to meet user demand, allowing these desktop applications to run efficiently in a cloud environment. This approach makes it feasible to support resource-intensive GUI tools in scenarios where static provisioning is costly or infeasible. We describe our deployment strategy, emphasizing that this model offers a workflow for integrating desktop applications with notebook-based gateway features and applicable to other domains with similar needs.
#+END_SRC

#+BEGIN_SRC emacs-lisp :var text=abstract :exports none :results replace raw :eval no
(format "#+latex: \\begin{abstract}\n%s\n#+latex: \\end{abstract}" text)
#+END_SRC

#+RESULTS:
#+latex: \begin{abstract}
We present an application of a new capability on the NSF Jetstream2 cloud that enables scalable access to established scientific desktop applications in the atmospheric sciences, including the Unidata Integrated Data Viewer (IDV), the AWIPS CAVE client, and the LROSE Hawkeye tool. By leveraging OpenStack Magnum's Kubernetes autoscaling clusters-as-a-service, in combination with JupyterHub and VNC technology, the NSF Unidata Science Gateway dynamically provisions server resources to meet user demand, allowing these desktop applications to run efficiently in a cloud environment. This approach makes it feasible to support resource-intensive GUI tools in scenarios where static provisioning is costly or infeasible. We describe our deployment strategy, emphasizing that this model offers a workflow for integrating desktop applications with notebook-based gateway features and applicable to other domains with similar needs.
#+latex: \end{abstract}

#+name: keywords
#+BEGIN_SRC org :exports none
AWIPS CAVE, Atmospheric Science, Autoscaling, Data Visualization, IDV, Jetstream2, JupyterHub, Kubernetes, NSF Unidata, OpenStack Magnum, Scientific GUI Applications, VNC Virtual Desktop
#+END_SRC

#+BEGIN_SRC emacs-lisp :var text=keywords :exports none :results replace raw :eval no
  (format "#+latex: \\begin{IEEEkeywords}\n%s\n#+latex: \\end{IEEEkeywords}" text)
#+END_SRC

#+RESULTS:
#+latex: \begin{IEEEkeywords}
AWIPS CAVE, Atmospheric Science, Autoscaling, Data Visualization, IDV, Jetstream2, JupyterHub, Kubernetes, NSF Unidata, OpenStack Magnum, Scientific GUI Applications, VNC Virtual Desktop
#+latex: \end{IEEEkeywords}

